'use client'
import React, {FC, useEffect} from 'react';
import styles from './AdvantagesSection.module.scss';
import Swiper from "swiper";
import {SwiperOptions} from "swiper/types";
import {Swiper as SwiperComp, SwiperSlide} from "swiper/react";
import {Pagination} from "swiper/modules";
import 'swiper/scss';
import 'swiper/scss/navigation';
import 'swiper/scss/pagination';
import './SwiperStyles.scss';

const AdvantagesSection: FC = () => {
    // useEffect(() => {
    //     const resizableSwiper = (breakpointIn: string, swiperClass: string, swiperSettings: SwiperOptions, callback?: (arg: object) => void) => {
    //         let swiper:any;
    //
    //         const breakpoint = window.matchMedia(breakpointIn);
    //
    //         const enableSwiper = function(className: string, settings: SwiperOptions) {
    //             swiper = new Swiper(className, settings);
    //
    //             if (callback) {
    //                 callback(swiper);
    //             }
    //         }
    //
    //         const checker = function() {
    //             if (breakpoint.matches) {
    //                 return enableSwiper(swiperClass, swiperSettings);
    //             } else {
    //                 if (swiper !== undefined) swiper.destroy(true, true);
    //                 return;
    //             }
    //         }
    //
    //         breakpoint.addEventListener('change', checker);
    //         checker();
    //     }
    //
    //     resizableSwiper(
    //         '(max-width: 950px)',
    //         '.advantagesSlider',
    //         {
    //             modules: [Pagination],
    //             loop: false,
    //             spaceBetween: 20,
    //             slidesPerView: 'auto',
    //             centeredSlides: true,
    //             pagination: {
    //                 el: '.swiper-pagination',
    //                 type: 'bullets',
    //                 clickable: true
    //             },
    //
    //         }
    //     )
    // }, []);

    return (
        <section className={`${styles.advantagesSection} section`}>
            <h1 className={`${styles.advantagesTitle} titleNotoFont`}>
                Преимущества вызова замерщика от фабрики «Твоя кухня»
            </h1>
            <div className={`${styles.advantagesContainer} gridBlock`}>
                <div className={`${styles.advantagesBlock}`}>
                    <div className={`${styles.advantagesItem}`}>
                        <div className={styles.advantageIconBlock}>
                            <svg className={styles.advantageIcon} width="40" height="40" viewBox="0 0 40 40" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M36.7109 1.46661L38.5412 3.29694C40.4967 5.25242 40.4967 8.4203 38.5412 10.3758L34.1296 14.7874L25.2126 5.87818L29.6242 1.46661C31.5797 -0.48887 34.7476 -0.48887 36.7031 1.46661H36.7109ZM3.51462 27.584L23.4449 7.64593L32.3619 16.5629L12.4238 36.4932C11.8997 37.0173 11.2427 37.4005 10.5309 37.6039L2.39608 39.927C1.73904 40.1148 1.03507 39.9348 0.55011 39.4499C0.0651503 38.9649 -0.114754 38.261 0.0729721 37.6039L2.39608 29.4691C2.59945 28.7495 2.98273 28.1003 3.5068 27.5762L3.51462 27.584ZM19.5105 8.04485L8.09045 19.4649L1.25408 12.6207C-0.208617 11.158 -0.208617 8.78011 1.25408 7.30959L7.36301 1.20849C8.82571 -0.254213 11.2036 -0.254213 12.6741 1.20849L14.2228 2.75723C14.1994 2.7807 14.1681 2.80416 14.1446 2.82763L9.13859 7.83366C8.65363 8.31862 8.65363 9.11646 9.13859 9.60142C9.62355 10.0864 10.4214 10.0864 10.9063 9.60142L15.9124 4.59538C15.9358 4.57192 15.9593 4.54063 15.9828 4.51716L19.5105 8.04485ZM31.963 20.4974L35.4907 24.0251C35.4672 24.0485 35.4359 24.072 35.4124 24.0954L30.4064 29.1015C29.9214 29.5864 29.9214 30.3843 30.4064 30.8692C30.8914 31.3542 31.6892 31.3542 32.1742 30.8692L37.1802 25.8632C37.2037 25.8397 37.2271 25.8085 37.2506 25.785L38.7993 27.3415C40.262 28.8042 40.262 31.1821 38.7993 32.6526L32.6904 38.7537C31.2277 40.2164 28.8498 40.2164 27.3793 38.7537L20.543 31.9174L31.963 20.4974Z"
                                    fill="#DED6CC"/>
                            </svg>
                        </div>
                        <h3 className={styles.advantageTitle}>Визит замерщика
                            в любой удобный для Вас день</h3>
                        <p className={styles.advantageText}>Наши специалисты работают даже
                            по выходным, решить вопрос с заказом понравившейся
                            мебели можете в любой удобный для Вас день.
                            Сотрудники компании ценят время клиента, поэтому
                            пунктуальны.</p>
                    </div>
                    <div className={`${styles.advantagesItem} swiper-slide`}>
                        <div className={styles.advantageIconBlock}>
                            <svg width="40" height="40" viewBox="0 0 40 40" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M29.5247 34.9478L35.7957 28.7739L34.4135 27.3895L29.5247 32.2098L27.4137 30.0569L26.0293 31.4524L29.5247 34.9478ZM6.11648 10.4444H29.2178V8.23627H6.11427L6.11648 10.4444ZM30.9136 40C28.4538 40 26.3664 39.1433 24.6514 37.4298C22.9364 35.7163 22.0797 33.6289 22.0811 31.1675C22.0811 28.7092 22.9379 26.6225 24.6514 24.9075C26.3649 23.1926 28.4523 22.3351 30.9136 22.3351C33.3734 22.3351 35.4609 23.1926 37.1758 24.9075C38.8908 26.6225 39.7475 28.7092 39.7461 31.1675C39.7461 33.6289 38.8893 35.7163 37.1758 37.4298C35.4594 39.1433 33.372 40 30.9136 40ZM0 37.0301V3.5661C0 2.57981 0.34741 1.73852 1.04223 1.04223C1.73705 0.34741 2.57834 0 3.5661 0H31.7637C32.75 0 33.5913 0.34741 34.2876 1.04223C34.9824 1.73705 35.3298 2.57834 35.3298 3.5661V16.6933C34.0167 16.262 32.6713 16.0405 31.2934 16.0287C29.917 16.0155 28.559 16.1928 27.2194 16.5609H6.11427V18.769H22.26C21.153 19.5359 20.177 20.4361 19.332 21.4695C18.4871 22.5029 17.7915 23.6408 17.2454 24.8832H6.11648V27.0914H16.5145C16.3555 27.6861 16.2319 28.2859 16.1435 28.891C16.0552 29.496 16.0103 30.1275 16.0088 30.7855C16.0088 31.7939 16.1141 32.7942 16.3246 33.7864C16.5366 34.7785 16.8531 35.7347 17.2741 36.6547L17.1968 36.732L14.6928 34.9059L11.7207 37.0279L8.74855 34.9059L5.77422 37.0279L2.8021 34.9059L0 37.0301Z"
                                    fill="#DED6CC"/>
                            </svg>
                        </div>
                        <h3 className={styles.advantageTitle}>Заказать дизайн проект кухни бесплатно</h3>
                        <p className={styles.advantageText}>При визите специалиста в пределах МКАДа и до 15 км
                            за ним, его услуги будут безвозмездными, даже если вы откажетесь от изготовления
                            гарнитура. В населенные пункты ближайших к Москве областей специалист выезжает по
                            договоренности, в среднем 40 руб. за км от МКАДа.</p>
                    </div>
                    <div className={`${styles.advantagesItem} swiper-slide`}>
                        <div className={styles.advantageIconBlock}>
                            <svg width="40" height="40" viewBox="0 0 40 40" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M0 20V11.6667H16.6667V20H0ZM16.6667 8.33333V0H0V8.33333H16.6667ZM16.6667 23.3333V31.6667C16.6667 36.2683 12.935 40 8.33333 40C3.73167 40 0 36.2683 0 31.6667V23.3333H16.6667ZM10.8333 31.6667C10.8333 30.2867 9.71333 29.1667 8.33333 29.1667C6.95333 29.1667 5.83333 30.2867 5.83333 31.6667C5.83333 33.0467 6.95333 34.1667 8.33333 34.1667C9.71333 34.1667 10.8333 33.0467 10.8333 31.6667ZM16.6667 8.33333V0H0V8.33333H16.6667ZM16.6667 23.3333V31.6667C16.6667 36.2683 12.935 40 8.33333 40C3.73167 40 0 36.2683 0 31.6667V23.3333H16.6667ZM10.8333 31.6667C10.8333 30.2867 9.71333 29.1667 8.33333 29.1667C6.95333 29.1667 5.83333 30.2867 5.83333 31.6667C5.83333 33.0467 6.95333 34.1667 8.33333 34.1667C9.71333 34.1667 10.8333 33.0467 10.8333 31.6667ZM20 31.6667C20 31.7067 20 31.7467 20 31.7867L36.6183 15.1683L24.8333 3.38333L20.0017 8.215V31.6667H20ZM16.4983 40H40V23.3333H33.1667L16.4983 40Z"
                                    fill="#DED6CC"/>
                            </svg>
                        </div>
                        <h3 className={styles.advantageTitle}>Образцы всегда с собой</h3>
                        <p className={styles.advantageText}>При вызове замерщика кухни к вам приезжает наш
                            мини-офис с большим выбором образцов (фасады, столешницы, материалы). Это дает
                            возможность оценить качество, реальный оттенок будущей мебели. А по каталогам вы
                            получаете доступ к примерам дизайна, моделям фурнитуры.</p>
                    </div>
                    <div className={`${styles.advantagesItem} swiper-slide`}>
                        <div className={styles.advantageIconBlock}>
                            <svg width="67" height="42" viewBox="0 0 67 42" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M45.2648 0.530762H36.3202C35.4871 0.530762 34.6853 0.850056 34.071 1.42479L23.8351 11.0036C23.8247 11.0143 23.8143 11.0356 23.8039 11.0462C22.0753 12.7065 22.1066 15.3567 23.5852 17.0064C24.9076 18.4858 27.6879 18.8796 29.4268 17.2937C29.4372 17.2831 29.4581 17.2831 29.4685 17.2724L37.7884 9.48165C38.4652 8.85371 39.5273 8.89628 40.1417 9.58808C40.7665 10.2799 40.7144 11.3548 40.0376 11.9934L37.3198 14.5371L52.481 27.1174C52.7829 27.3728 53.0537 27.6495 53.3036 27.9369V7.34238L47.6181 1.53122C47.0038 0.892629 46.1499 0.530762 45.2648 0.530762ZM56.6461 7.36366V31.1937C56.6461 33.0775 58.1352 34.5995 59.9782 34.5995H66.6425V7.36366H56.6461ZM61.6443 31.1937C60.728 31.1937 59.9782 30.4274 59.9782 29.4908C59.9782 28.5542 60.728 27.7879 61.6443 27.7879C62.5606 27.7879 63.3104 28.5542 63.3104 29.4908C63.3104 30.4274 62.5606 31.1937 61.6443 31.1937ZM0 34.5888H6.66425C8.50733 34.5888 9.99637 33.0669 9.99637 31.183V7.36366H0V34.5888ZM4.99819 27.7879C5.91452 27.7879 6.66425 28.5542 6.66425 29.4908C6.66425 30.4274 5.91452 31.1937 4.99819 31.1937C4.08185 31.1937 3.33212 30.4274 3.33212 29.4908C3.33212 28.5435 4.08185 27.7879 4.99819 27.7879ZM50.388 29.7675L34.8415 16.868L31.7177 19.7949C28.625 22.6792 23.8872 22.4024 21.1278 19.3266C18.3267 16.1975 18.5454 11.3548 21.5859 8.50248L30.1037 0.530762H21.3777C20.4926 0.530762 19.6491 0.892629 19.0243 1.53122L13.3285 7.34238V31.1724H15.2341L24.6577 39.8891C27.5109 42.2626 31.7072 41.8155 34.0293 38.8993L34.0501 38.878L35.9141 40.5277C37.5697 41.9113 40.0167 41.6453 41.36 39.953L44.6296 35.8447L45.1919 36.313C46.6185 37.4944 48.7219 37.2816 49.8777 35.8128L50.867 34.5676C52.0332 33.0988 51.8145 30.9595 50.388 29.7675Z"
                                    fill="#DED6CC"/>
                            </svg>
                        </div>
                        <h3 className={styles.advantageTitle}>Согласование за один день</h3>
                        <p className={styles.advantageText}>Сотрудники компании «Твоя кухня» имеют полномочия
                            на заключение договора и принятие предоплаты. Вы можете заказать проект кухни
                            бесплатно, и, если он вас устроит, оформить заявку на изготовление гарнитура.
                            После согласования деталей мебель поступит в производство.</p>
                    </div>
                </div>
                <div className="swiper-pagination"></div>
            </div>
            <SwiperComp
                modules={[Pagination]}
                slidesPerView={'auto'}
                spaceBetween={20}
                className={`${styles.advantagesContainer} gridBlock swiper advantages-slider`}
                wrapperClass={`${styles.advantagesBlock} swiper-wrapper`}
                pagination={{
                    type: "bullets",
                    clickable: true
                }}
                centeredSlides={true}
            >
                <SwiperSlide className={`${styles.advantagesItem} swiper-slide`}>
                    <div className={`${styles.advantagesItem} swiper-slide`}>
                        <div className={styles.advantageIconBlock}>
                            <svg className={styles.advantageIcon} width="40" height="40" viewBox="0 0 40 40" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M36.7109 1.46661L38.5412 3.29694C40.4967 5.25242 40.4967 8.4203 38.5412 10.3758L34.1296 14.7874L25.2126 5.87818L29.6242 1.46661C31.5797 -0.48887 34.7476 -0.48887 36.7031 1.46661H36.7109ZM3.51462 27.584L23.4449 7.64593L32.3619 16.5629L12.4238 36.4932C11.8997 37.0173 11.2427 37.4005 10.5309 37.6039L2.39608 39.927C1.73904 40.1148 1.03507 39.9348 0.55011 39.4499C0.0651503 38.9649 -0.114754 38.261 0.0729721 37.6039L2.39608 29.4691C2.59945 28.7495 2.98273 28.1003 3.5068 27.5762L3.51462 27.584ZM19.5105 8.04485L8.09045 19.4649L1.25408 12.6207C-0.208617 11.158 -0.208617 8.78011 1.25408 7.30959L7.36301 1.20849C8.82571 -0.254213 11.2036 -0.254213 12.6741 1.20849L14.2228 2.75723C14.1994 2.7807 14.1681 2.80416 14.1446 2.82763L9.13859 7.83366C8.65363 8.31862 8.65363 9.11646 9.13859 9.60142C9.62355 10.0864 10.4214 10.0864 10.9063 9.60142L15.9124 4.59538C15.9358 4.57192 15.9593 4.54063 15.9828 4.51716L19.5105 8.04485ZM31.963 20.4974L35.4907 24.0251C35.4672 24.0485 35.4359 24.072 35.4124 24.0954L30.4064 29.1015C29.9214 29.5864 29.9214 30.3843 30.4064 30.8692C30.8914 31.3542 31.6892 31.3542 32.1742 30.8692L37.1802 25.8632C37.2037 25.8397 37.2271 25.8085 37.2506 25.785L38.7993 27.3415C40.262 28.8042 40.262 31.1821 38.7993 32.6526L32.6904 38.7537C31.2277 40.2164 28.8498 40.2164 27.3793 38.7537L20.543 31.9174L31.963 20.4974Z"
                                    fill="#DED6CC"/>
                            </svg>
                        </div>
                        <h3 className={styles.advantageTitle}>Визит замерщика
                            в любой удобный для Вас день</h3>
                        <p className={styles.advantageText}>Наши специалисты работают даже
                            по выходным, решить вопрос с заказом понравившейся
                            мебели можете в любой удобный для Вас день.
                            Сотрудники компании ценят время клиента, поэтому
                            пунктуальны.</p>
                    </div>
                </SwiperSlide>
                <SwiperSlide className={`${styles.advantagesItem} swiper-slide`}>
                    <div className={`${styles.advantagesItem} swiper-slide`}>
                        <div className={styles.advantageIconBlock}>
                            <svg width="40" height="40" viewBox="0 0 40 40" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M29.5247 34.9478L35.7957 28.7739L34.4135 27.3895L29.5247 32.2098L27.4137 30.0569L26.0293 31.4524L29.5247 34.9478ZM6.11648 10.4444H29.2178V8.23627H6.11427L6.11648 10.4444ZM30.9136 40C28.4538 40 26.3664 39.1433 24.6514 37.4298C22.9364 35.7163 22.0797 33.6289 22.0811 31.1675C22.0811 28.7092 22.9379 26.6225 24.6514 24.9075C26.3649 23.1926 28.4523 22.3351 30.9136 22.3351C33.3734 22.3351 35.4609 23.1926 37.1758 24.9075C38.8908 26.6225 39.7475 28.7092 39.7461 31.1675C39.7461 33.6289 38.8893 35.7163 37.1758 37.4298C35.4594 39.1433 33.372 40 30.9136 40ZM0 37.0301V3.5661C0 2.57981 0.34741 1.73852 1.04223 1.04223C1.73705 0.34741 2.57834 0 3.5661 0H31.7637C32.75 0 33.5913 0.34741 34.2876 1.04223C34.9824 1.73705 35.3298 2.57834 35.3298 3.5661V16.6933C34.0167 16.262 32.6713 16.0405 31.2934 16.0287C29.917 16.0155 28.559 16.1928 27.2194 16.5609H6.11427V18.769H22.26C21.153 19.5359 20.177 20.4361 19.332 21.4695C18.4871 22.5029 17.7915 23.6408 17.2454 24.8832H6.11648V27.0914H16.5145C16.3555 27.6861 16.2319 28.2859 16.1435 28.891C16.0552 29.496 16.0103 30.1275 16.0088 30.7855C16.0088 31.7939 16.1141 32.7942 16.3246 33.7864C16.5366 34.7785 16.8531 35.7347 17.2741 36.6547L17.1968 36.732L14.6928 34.9059L11.7207 37.0279L8.74855 34.9059L5.77422 37.0279L2.8021 34.9059L0 37.0301Z"
                                    fill="#DED6CC"/>
                            </svg>
                        </div>
                        <h3 className={styles.advantageTitle}>Заказать дизайн проект кухни бесплатно</h3>
                        <p className={styles.advantageText}>При визите специалиста в пределах МКАДа и до 15 км
                            за ним, его услуги будут безвозмездными, даже если вы откажетесь от изготовления
                            гарнитура. В населенные пункты ближайших к Москве областей специалист выезжает по
                            договоренности, в среднем 40 руб. за км от МКАДа.</p>
                    </div>
                </SwiperSlide>
                <SwiperSlide className={`${styles.advantagesItem} swiper-slide`}>
                    <div className={`${styles.advantagesItem} swiper-slide`}>
                        <div className={styles.advantageIconBlock}>
                            <svg width="40" height="40" viewBox="0 0 40 40" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M0 20V11.6667H16.6667V20H0ZM16.6667 8.33333V0H0V8.33333H16.6667ZM16.6667 23.3333V31.6667C16.6667 36.2683 12.935 40 8.33333 40C3.73167 40 0 36.2683 0 31.6667V23.3333H16.6667ZM10.8333 31.6667C10.8333 30.2867 9.71333 29.1667 8.33333 29.1667C6.95333 29.1667 5.83333 30.2867 5.83333 31.6667C5.83333 33.0467 6.95333 34.1667 8.33333 34.1667C9.71333 34.1667 10.8333 33.0467 10.8333 31.6667ZM16.6667 8.33333V0H0V8.33333H16.6667ZM16.6667 23.3333V31.6667C16.6667 36.2683 12.935 40 8.33333 40C3.73167 40 0 36.2683 0 31.6667V23.3333H16.6667ZM10.8333 31.6667C10.8333 30.2867 9.71333 29.1667 8.33333 29.1667C6.95333 29.1667 5.83333 30.2867 5.83333 31.6667C5.83333 33.0467 6.95333 34.1667 8.33333 34.1667C9.71333 34.1667 10.8333 33.0467 10.8333 31.6667ZM20 31.6667C20 31.7067 20 31.7467 20 31.7867L36.6183 15.1683L24.8333 3.38333L20.0017 8.215V31.6667H20ZM16.4983 40H40V23.3333H33.1667L16.4983 40Z"
                                    fill="#DED6CC"/>
                            </svg>
                        </div>
                        <h3 className={styles.advantageTitle}>Образцы всегда с собой</h3>
                        <p className={styles.advantageText}>При вызове замерщика кухни к вам приезжает наш
                            мини-офис с большим выбором образцов (фасады, столешницы, материалы). Это дает
                            возможность оценить качество, реальный оттенок будущей мебели. А по каталогам вы
                            получаете доступ к примерам дизайна, моделям фурнитуры.</p>
                    </div>
                </SwiperSlide>
                <SwiperSlide className={`${styles.advantagesItem} swiper-slide`}>
                    <div className={`${styles.advantagesItem} swiper-slide`}>
                        <div className={styles.advantageIconBlock}>
                            <svg width="67" height="42" viewBox="0 0 67 42" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M45.2648 0.530762H36.3202C35.4871 0.530762 34.6853 0.850056 34.071 1.42479L23.8351 11.0036C23.8247 11.0143 23.8143 11.0356 23.8039 11.0462C22.0753 12.7065 22.1066 15.3567 23.5852 17.0064C24.9076 18.4858 27.6879 18.8796 29.4268 17.2937C29.4372 17.2831 29.4581 17.2831 29.4685 17.2724L37.7884 9.48165C38.4652 8.85371 39.5273 8.89628 40.1417 9.58808C40.7665 10.2799 40.7144 11.3548 40.0376 11.9934L37.3198 14.5371L52.481 27.1174C52.7829 27.3728 53.0537 27.6495 53.3036 27.9369V7.34238L47.6181 1.53122C47.0038 0.892629 46.1499 0.530762 45.2648 0.530762ZM56.6461 7.36366V31.1937C56.6461 33.0775 58.1352 34.5995 59.9782 34.5995H66.6425V7.36366H56.6461ZM61.6443 31.1937C60.728 31.1937 59.9782 30.4274 59.9782 29.4908C59.9782 28.5542 60.728 27.7879 61.6443 27.7879C62.5606 27.7879 63.3104 28.5542 63.3104 29.4908C63.3104 30.4274 62.5606 31.1937 61.6443 31.1937ZM0 34.5888H6.66425C8.50733 34.5888 9.99637 33.0669 9.99637 31.183V7.36366H0V34.5888ZM4.99819 27.7879C5.91452 27.7879 6.66425 28.5542 6.66425 29.4908C6.66425 30.4274 5.91452 31.1937 4.99819 31.1937C4.08185 31.1937 3.33212 30.4274 3.33212 29.4908C3.33212 28.5435 4.08185 27.7879 4.99819 27.7879ZM50.388 29.7675L34.8415 16.868L31.7177 19.7949C28.625 22.6792 23.8872 22.4024 21.1278 19.3266C18.3267 16.1975 18.5454 11.3548 21.5859 8.50248L30.1037 0.530762H21.3777C20.4926 0.530762 19.6491 0.892629 19.0243 1.53122L13.3285 7.34238V31.1724H15.2341L24.6577 39.8891C27.5109 42.2626 31.7072 41.8155 34.0293 38.8993L34.0501 38.878L35.9141 40.5277C37.5697 41.9113 40.0167 41.6453 41.36 39.953L44.6296 35.8447L45.1919 36.313C46.6185 37.4944 48.7219 37.2816 49.8777 35.8128L50.867 34.5676C52.0332 33.0988 51.8145 30.9595 50.388 29.7675Z"
                                    fill="#DED6CC"/>
                            </svg>
                        </div>
                        <h3 className={styles.advantageTitle}>Согласование за один день</h3>
                        <p className={styles.advantageText}>Сотрудники компании «Твоя кухня» имеют полномочия
                            на заключение договора и принятие предоплаты. Вы можете заказать проект кухни
                            бесплатно, и, если он вас устроит, оформить заявку на изготовление гарнитура.
                            После согласования деталей мебель поступит в производство.</p>
                    </div>
                </SwiperSlide>
            </SwiperComp>
        </section>
    );
};

export default AdvantagesSection;